In [1]:
import csv

In [2]:
import sqlite3

In [6]:
import sqlite3
import pandas.io.sql as sql
con = sqlite3.connect('touches.sqlite3')
touches = sql.read_sql('select * from touches', con)
companies = sql.read_sql('select * from companies', con)
opportunities = sql.read_sql('select * from opportunities', con)
persons = sql.read_sql('select * from persons', con)

In [7]:
touches.to_csv("./data/touches.csv")

In [8]:
companies.to_csv("./data/companies.csv")

In [9]:
opportunities.to_csv("./data/opportunities.csv")

In [10]:
persons.to_csv("./data/persons.csv")

In [11]:
persons

            id  company_id           job_seniority
0           61           1          Vice President
1           62           1                 Manager
2           63           1               Executive
3           64           1                Director
4           65           1  Individual Contributor
...        ...         ...                     ...
177603  235423        8327                Director
177604  235424        8327                Director
177605  235425        8327                 Manager
177606  235426        8327                 Unknown
177607  235427        8327  Individual Contributor

[177608 rows x 3 columns]